In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
july = pd.read_pickle('../data/july.pkl')
july.head()

,pubdatetime,latitude,longitude,sumdid,chargelevel,companyname
0,2019-07-01 00:00:33.550,36.156678,-86.809004,Powered635135,22.0,1
1,2019-07-01 00:00:34.973,36.145674,-86.794138,Powered790946,33.0,1
2,2019-07-01 00:00:41.183,36.179319,-86.751538,Powered570380,76.0,1
3,2019-07-01 00:00:41.620,36.152111,-86.803821,Powered240631,43.0,1
4,2019-07-01 00:00:45.087,36.149355,-86.797550,Powered970404,52.0,1

In [3]:
july.tail()

,pubdatetime,latitude,longitude,sumdid,chargelevel,companyname
25075440,2019-07-31 23:59:57,36.162420,-86.779314,Powered-1a8321d0-5c21-04a4-bd7d-7b96ba51f17b,100.00,6
25075441,2019-07-31 23:59:57,36.146010,-86.810197,Powered-bd4ba83b-513f-ed5c-3c51-b4f51e7fdc51,100.00,6
25075442,2019-07-31 23:59:57,36.165837,-86.777765,Powered-cc9c0b7e-2b9e-def9-e48b-1a8a489c4daf,71.68,6
25075443,2019-07-31 23:59:57,36.149792,-86.806818,Powered-55a7ac02-7e17-bb3b-130d-b160d9776405,0.00,6
25075444,2019-07-31 23:59:57,36.162644,-86.779345,Powered-03be23ca-d43b-222f-be54-e44b5b4690df,100.00,6

In [4]:
july.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 25066524 entries, 0 to 25075444
Data columns (total 6 columns):
 #   Column       Dtype
---  ------       -----
 0   pubdatetime  datetime64[ns]
 1   latitude     float64
 2   longitude    float64
 3   sumdid       object
 4   chargelevel  float64
 5   companyname  int64
dtypes: datetime64[ns](1), float64(3), int64(1), object(1)
memory usage: 1.3+ GB

july is 3 million rows smaller than june, even though the month is longer and should have more data as a result ...

In [5]:
july['sumdid'].value_counts()

PoweredK7VBEW7S2VHPG                           8915
PoweredSMYDSCUCCKE3D                           8910
PoweredCPBMGOVZOHE4Z                           8909
Powered581a2464-b7ea-5d81-b4e1-4507bc3cd51f    8901
Powered98faa79c-2d9d-5417-8f22-594ca028fdfe    8901
                                               ...
Powered4314410                                    1
Powered3ZPZ7                                      1
PoweredMMQC4MGMOH675                              1
Powered5WF3M                                      1
PoweredBHQPF4NGORWCW                              1
Name: sumdid, Length: 6787, dtype: int64

there are even fewer scooters in july than in june - down another 1035.  more tourists in the summer, but fewer students?

In [6]:
july['companyname'].value_counts()

5    10367575
0     3702282
3     3233573
1     2890233
2     1933513
4     1750581
6     1188767
Name: companyname, dtype: int64

company 5 is at the top again.  
company 3 slid down another spot in data entry.  
company 0 moved up a spot

In [7]:
july_company_group = july.groupby("companyname")
july_scooter_company = july_company_group.agg({"sumdid": "nunique"})
print(july_scooter_company)

             sumdid
companyname
0              2583
1              1026
2               224
3               902
4               570
5              1206
6               276

company 0 dropped another 327;
company 1 dropped another 126; 
company 2 gained 1 scooter;
company 3 dropped another 553;
company 4 dropped 143;
company 5 gained 170 scooters;
company 6 dropped another 57 scooters

In [8]:
july.isnull().sum()

pubdatetime      0
latitude         0
longitude        0
sumdid           0
chargelevel    202
companyname      0
dtype: int64

In [9]:
july_nullcharge_company= july.chargelevel.isnull().groupby(july.companyname).sum()
print(july_nullcharge_company)

companyname
0      0
1      0
2      0
3      0
4      0
5      0
6    202
Name: chargelevel, dtype: int64

company 6 has all the nulls again

In [10]:
july.groupby("sumdid").filter(lambda x: len(x) == 1)

,pubdatetime,latitude,longitude,sumdid,chargelevel,companyname
1767252,2019-07-03 00:16:40.223,36.157689,-86.780898,PoweredC7EZRZTYAREOS,20.0,3
4342700,2019-07-05 21:29:12.997,36.158526,-86.768371,PoweredCPHMRCMZUUDRA,0.0,3
5286939,2019-07-07 00:05:09.727,36.156435,-86.780193,Powered6TPOZJO4U6WGE,55.0,3
9275444,2019-07-11 18:54:46.290,36.147753,-86.740528,Powered2045928,36.0,4
12982124,2019-07-16 10:28:54.357,36.151911,-86.781074,PoweredMMQC4MGMOH675,51.0,3
15955523,2019-07-20 01:52:17.300,36.159918,-86.773954,Powered6EPAKQB4QHWJF,34.0,3
18907914,2019-07-24 01:40:37.453,36.169105,-86.786400,PoweredBHQPF4NGORWCW,46.0,3
20679436,2019-07-26 11:12:13.690,36.147950,-86.740510,Powered4314410,100.0,4
21662119,2019-07-27 17:05:23.127,36.158738,-86.768364,PoweredA9GT8,99.0,0
23165398,2019-07-29 16:31:47.630,36.158474,-86.768241,Powered3ZPZ7,23.0,0
24972252,2019-07-31 21:18:13.167,36.073140,-86.797854,Powered5WF3M,77.0,0

11 scooters this time with just 1 entry - companies 3 and 4 the biggest offenders yet again